e = float(input("Введите значение эпсилон (например, 0.01): "))
total_sum = 0
n = 1
max_iterations = 100  # Защита от зацикливания

while n <= max_iterations:
    a_n = ((-1)**(n - 1)) / (n**n) # Формула члена ряда
    
    if abs(a_n) < e:
        break
        
    total_sum += a_n
    n += 1
else: # В случае если произошло зацикливание
    print("Достигнут лимит итераций! Расчет остановлен (зацикливание).")
    exit()

print(f"Сумма членов ряда = {total_sum:.10f}")
print(f"Количество членов ряда = {n-1}")
# При e == 0.01: n1 == 1; n2 == (-1)^1/4 = -0.25; n3 == (-1)^2/27 = 0.037037; n4 == (-1)^3/256 = -0.003906 (n4 не входит при эпсилон равном 0.01)
# Сумма == 1 - 0.25 + 0.037037 = 0.787037